Page({
  data: {
    title_whole: 'UE4学习',
    name: '钟圳钊',
    area:'\n&emsp;&nbsp;2016级\n&emsp;&nbsp;游戏',
    portrait: 'http://a3.qpic.cn/psb?/V10gCV4v0eA0sv/smgdm9RYdVq.zmemEHDhhkctEpvYJqrM*vbAQqmqSN4!/b/dLYAAAAAAAAA&ek=1&kp=1&pt=0&bo=gAKAAgAAAAARFyA!&tl=3&vuin=2362869094&t',
    content: [//图片与段落
      {
        title: '1 什么是虚幻4',
        passage: '&emsp;&emsp;虚幻4，英文名Unreal Engine 4，是Epic Game公司研发的一款免费开源的游戏开发引擎，这里的4表示为第四代，前面还有UE1，2，3代，以及免费的UDK版本，这些都是历史了。\n\n&emsp;&emsp;UE4的作品有很多，经常被游戏公司用于开发大型3A游戏大作，大家经常说的吃鸡（绝地求生）就是用虚幻4开发的，其他比较火的比如堡垒之夜，手游版吃鸡这些也是用虚幻4开发的。其实虚幻4的作品远不止于此，感兴趣的同学可以自己百度一下。',
      },
      {
        title:'2 你想用UE4做什么',
        passage: '&emsp;&emsp;虚幻4定义上来说是一款强大的游戏引擎，但是由于其出色的画面表现力，以及方便美术人员的可视化编程蓝图，使得其在其他领域也是大展身手。目前，虚幻4被广泛用于游戏开发，影视制作，VR，AR，MR开发，虚拟样板间和工业产品展示。\n\n&emsp;&emsp;UE4开发的游戏数不胜数，影视制作上得益于虚幻4的PBR材质系统以及强大的实时渲染功能，像《斗罗大陆》、《武庚纪》、《枪神纪》等多部话题动画大作都基于虚幻4制作。还有比较前沿的技术像数字角色Siren，星战短片《Reflection》等。VR，AR这些制作上和游戏大同小异，只不过是交互形式上的改变，比如本来是用键盘移动角色物品什么的，现在变成了使用VR手柄进行操作，而像工业产品那些展示，则使用Unreal Studio进行开发。\n\n&emsp;&emsp;其实做游戏不外乎做两方面，一个是游戏表现力，即画面方向上的东西，另一个是交互，即操作玩法方面的东西。\n\n&emsp;&emsp;画面表现上，虚幻4主要依靠出色的shader以及强大的粒子系统可以实现令人惊艳的效果。另外像3D音效混响那些，游戏引擎基本都有。实现画面上还有像PostProcessVolume（后效处理体积），还有体积雾什么的，这些都是比较后面的东西了。\n\n&emsp;&emsp;游戏交互上，虚幻4采用了蓝图以及C++两种编写形式进行交互功能的实现。蓝图应该是很直观的一种代码形式了，主要是不用打代码，几个节点拉来拉去就可以实现一些功能，基本上引擎C++内嵌的功能，用蓝图都可以实现，不过蓝图是方便，但是优化不好，比较适合快速实现游戏原型，后期如果要进行游戏优化，或者实现引擎所没有的功能，则还是要用回C++，不过做好的蓝图也可以转化为C++，C++也做成蓝图，这些也是比较后面的东西了。\n\n&emsp;&emsp;如果是打算拿来做动画的话，那么要掌握好美工方面的知识，比如颜色贴图，法线贴图什么的，还有模型的绑定和动画，然后学一下LevelSequencer，基本上就可以做动画了。',
      },
      {
        title: '3 如何学习虚幻4\n',
        passage: '&emsp;&emsp;其实虚幻4在2015年才免费开源，市面上的教程着实不多，由于这是一款外国的游戏引擎，所以很多知识都是要等国内的大佬啃完，翻译成中文，然后才能看到，这是一件比较麻烦的事，当然，如果你懂得科学上网，同时看的下去英文，那么你可以选择去YouTube上看教学视频，那里基本上有接近第一手的教程，很多国内教程其实也是搬运国外的教程这样。\n\n&emsp;&emsp;或者如果你喜欢看书这种形式，想系统学习UE4的话，那你可以上官方文档，一个一个功能学过去，官方文档有中文版，算是比较良心了，不过有些比较新的功能目前只有英文。\n\n&emsp;&emsp;当然你也可以直接找我，我这里大概有100来G的教学视频以及一些电子书。因为你们没接触过，所以很多功能讲得比较粗略，真正对这款游戏引擎感兴趣的同学，其实自己过后会去搜，如果不感兴趣的话，我讲再多也没用。',
      }
      


    ]
  },




})